IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
AUTHOR. JORGE OMETTO - v2.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
OBJECT-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-VARIAVEIS.
       05 WS-IDADE      PIC 9(02) VALUE 56.
       05 WS-PROFISSAO  PIC X(25)  VALUE 'ANALISTA PROGRAMADOR'.
       05 WS-NOME       PIC X(30) VALUE 'Jorge Ometto'.
       05 WS-STATUS-ID  PIC X(20) VALUE SPACES.
       05 WS-SITUACAO   PIC X(12) VALUE SPACES.

PROCEDURE DIVISION.

0000-10-ROTINA-PRINCIPAL SECTION.

      PERFORM 0010-10-INICIO       
      PERFORM 0100-10-PROCESSA 
      PERFORM 0200-10-MOSTRA-DADOS
      GO TO   0900-10-FIM .

0000-99-EXIT. 
      EXIT.

0010-10-INICIO SECTION.
      
      DISPLAY 'NOME: '
      DISPLAY WS-NOME
      DISPLAY 'IDADE: '
      DISPLAY WS-IDADE 
      DISPLAY 'ANOS'.

0010-99-EXIT.
      EXIT.

0100-10-PROCESSA SECTION.
   
      IF WS-IDADE >= 18
           MOVE 'MAIOR DE IDADE' TO WS-STATUS-ID
      ELSE
           MOVE 'MENOR DE IDADE' TO WS-STATUS-ID
      END-IF
      
      IF WS-IDADE >= 60
           MOVE 'APOSENTAVEL' TO WS-SITUACAO
      ELSE
           MOVE 'ATIVO'       TO WS-SITUACAO
      END-IF.

0100-99-EXIT.
      EXIT.   

0200-10-MOSTRA-DADOS SECTION.

      DISPLAY WS-STATUS-ID
      DISPLAY WS-SITUACAO.

0200-99-EXIT.
      EXIT.

0900-10-FIM SECTION.
           
      STOP RUN.
