IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
AUTHOR. JORGE OMETTO - v2.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
OBJECT-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-MESSAGE   PIC X(20) VALUE 'teste 3!'.
01 WS-NUMBER    PIC 9(4)  VALUE 1234.
01 WS-NOME    PIC X(30) VALUE 'Jorge Ometto'.
PROCEDURE DIVISION.
      DISPLAY WS-MESSAGE.
      DISPLAY WS-NOME.
      STOP RUN.