IDENTIFICATION DIVISION.
PROGRAM-ID. PRG001.
AUTHOR. JORGE OMETTO - v2.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
OBJECT-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-VARIAVEIS.
      05 WS-CONTADOR     PIC 9(03) VALUE 1.
      05 WS-LIMITE       PIC 9(03) VALUE 5.
      05 WS-FIM          PIC X     VALUE 'N'.

PROCEDURE DIVISION.

0000-10-ROTINA-PRINCIPAL SECTION.

    PERFORM 0010-10-INICIO THRU 0100-99-EXIT  

    PERFORM UNTIL WS-FIM = 'S'
      PERFORM 0100-10-PROCESSA-REGISTRO THRU 0100-99-EXIT
      ADD 1 TO WS-CONTADOR
      IF WS-CONTADOR > WS-LIMITE
          MOVE 'S' TO WS-FIM
      END-IF
    END-PERFORM

    PERFORM 0900-10-FIM .

0000-99-EXIT. 
      EXIT.

0010-10-INICIO SECTION.
      
      DISPLAY 'INICIO DO PROCESSAMENTO BATCH'
      DISPLAY ' '.

0010-99-EXIT.
      EXIT.

0100-10-PROCESSA-REGISTRO SECTION.
   
      DISPLAY 'PROCESSANDO REGISTRO: ' WS-CONTADOR
      IF WS-CONTADOR = 3 
         DISPLAY 'REGISTRO ' WS-CONTADOR ' COM ERRO.'
      ELSE
         CONTINUE
      END-IF
      IF WS-CONTADOR = 5
         MOVE 'S'
      END-IF.
0100-99-EXIT.
      EXIT.   

0200-10-MOSTRA-DADOS SECTION.

      DISPLAY WS-STATUS-ID
      DISPLAY WS-SITUACAO.

0200-99-EXIT.
      EXIT.

0900-10-FIM SECTION.
           
      STOP RUN.