IDENTIFICATION DIVISION.
PROGRAM-ID. PRG007.
AUTHOR. JORGE OMETTO dia7.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ARQ-CLIENTES
        ASSIGN TO 'CLIENTES.DAT'
                ORGANIZATION IS LINE SEQUENTIAL
                FILE STATUS IS WS-FS.
                CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
OBJECT-COMPUTER. IBM-370.
DATA DIVISION.
FILE SECTION.
FD  ARQ-CLIENTES.
01  REG-CLIENTE.
    05 CLI-ID     PIC 9(05).
    05 CLI-NOME   PIC X(30).
WORKING-STORAGE SECTION.
01  WS-FS           PIC 99.
    88  FS-OK       VALUE 00.
    88  FS-EOF      VALUE 10.
01 WS-VARIAVEIS.
      05 WS-NUMERO     PIC 9(03) VALUE 1.
      05 WS-RESULTADO  PIC 9(03) VALUE 0.
      05 WS-RESTO      PIC 9(01) VALUE 0.
      05 WS-LIMITE     PIC 9(03) VALUE 10.
      05 WS-QTDE-LIDA  PIC 9(05) VALUE 0.
      05 WS-FIM-ARQ    PIC X VALUE 'N'.
      05 WS-FIM-PROC   PIC X VALUE 'N'.
 
PROCEDURE DIVISION.

0000-10-ROTINA-PRINCIPAL SECTION.

    PERFORM 0010-10-INICIO THRU 0010-99-EXIT
    PERFORM 0020-10-LE-ARQUIVO THRU 0020-99-EXIT
    IF WS-FIM-ARQ = 'S'
        DISPLAY 'ATENCAO: ARQUIVO VAZIO.'
        GO TO 0900-10-FIM
    END-IF 
    PERFORM 0100-10-PROCESSA-REGISTRO THRU 0100-99-EXIT
        UNTIL WS-FIM-ARQ = 'S'
    PERFORM 0900-10-FIM THRU 0900-99-EXIT
    STOP RUN.

0000-99-EXIT. 
      EXIT.

0010-10-INICIO SECTION.
      
    OPEN INPUT ARQ-CLIENTES
    IF WS-FS NOT = 00
     DISPLAY "Erro ao abrir arquivo. Status: " WS-FS
     STOP RUN
    END-IF
    DISPLAY 'INICIO DO PROCESSAMENTO BATCH'
    DISPLAY ' '.

0010-99-EXIT.
      EXIT.

0020-10-LE-ARQUIVO SECTION.
    READ ARQ-CLIENTES
        AT END
            MOVE 'S' TO WS-FIM-ARQ
            GO TO 0020-10-EXIT
    END-READ
    IF WS-FS NOT = 00
        DISPLAY "Erro LEITURA do arquivo. Status: " WS-FS
        STOP RUN
    END-IF
    ADD 1 TO WS-QTDE-LIDA.
0020-99-EXIT.
        EXIT.

0100-10-PROCESSA-REGISTRO SECTION.
   
      DISPLAY 'PROCESSANDO REGISTRO: ' WS-NUMERO
      IF WS-FIM-ARQ = 'N'
        DISPLAY 'ID: ' CLI-ID ' NOME: ' CLI-NOME
        PERFORM 0020-10-LE-ARQUIVO THRU 0020-99-EXIT
      END-IF.

0100-99-EXIT.
      EXIT.
0900-10-FIM SECTION.
    CLOSE ARQ-CLIENTES
    IF WS-FS NOT = 00
      DISPLAY "Erro ao fechar arquivo. Status: " WS-FS
      STOP RUN
    END-IF
    DISPLAY 'TOTAL DE REGISTROS LIDOS: ' WS-QTDE-LIDA
    DISPLAY 'FIM DO PROCESSAMENTO'.
0900-99-EXIT.
      EXIT.