IDENTIFICATION DIVISION.
PROGRAM-ID. PRG001.
AUTHOR. JORGE OMETTO - v2.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
OBJECT-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-VARIAVEIS.
      05 WS-CONTADOR     PIC 9(03) VALUE 1.
      05 WS-LIMITE       PIC 9(03) VALUE 5.

PROCEDURE DIVISION.

0000-10-ROTINA-PRINCIPAL SECTION.

    PERFORM 0010-10-INICIO THRU 0010-99-EXIT  

    PERFORM 0100-10-PROCESSA-REGISTRO THRU 0100-99-EXIT
      VARYING WS-CONTADOR FROM 1 BY 1 
      UNTIL 
    END-PERFORM

    PERFORM 0900-10-FIM .

0000-99-EXIT. 
      EXIT.

0010-10-INICIO SECTION.
      
      DISPLAY 'INICIO DO PROCESSAMENTO BATCH'
      DISPLAY ' '.

0010-99-EXIT.
      EXIT.

0100-10-PROCESSA-REGISTRO SECTION.
   
      DISPLAY 'PROCESSANDO REGISTRO: ' WS-CONTADOR
      IF WS-CONTADOR = 3 
         DISPLAY 'REGISTRO ' WS-CONTADOR ' COM ERRO.'
      ELSE
         CONTINUE
      END-IF.

0100-99-EXIT.
      EXIT.   

0900-10-FIM SECTION.
           
      STOP RUN.
