IDENTIFICATION DIVISION.
PROGRAM-ID. PRG007.
AUTHOR. JORGE OMETTO DIA-07.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
OBJECT-COMPUTER. IBM-370.

INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ARQ-CLIENTES
        ASSIGN TO 'CLIENTES.DAT'
                ORGANIZATION IS LINE SEQUENTIAL
                ACCESS MODE IS SEQUENTIAL
                FILE STATUS IS WS-FS-IN.
    SELECT ARQ-REJEITADOS
        ASSIGN TO 'REJEITADOS.DAT'
                ORGANIZATION IS LINE SEQUENTIAL
                ACCESS MODE IS SEQUENTIAL
                FILE STATUS IS WS-FS-OUT.

DATA DIVISION.
FILE SECTION.
FD  ARQ-CLIENTES.
01  REG-CLIENTE.
    05 CLI-ID     PIC 9(05).
    05 CLI-NOME   PIC X(30).
FD  ARQ-REJEITADOS.
01  REG-REJEITADOS.
    05 RJT-ID     PIC 9(05).
    05 RJT-NOME   PIC X(30).

WORKING-STORAGE SECTION.
01  WS-FS-IN          PIC 99.
    88  FS-OK-IN      VALUE 00.
    88  FS-EOF-IN     VALUE 10.
01 WS-FS-OUT          PIC 99.
    88  FS-OK-OUT     VALUE 00.
    88  FS-EOF-OUT    VALUE 10.
01 WS-VARIAVEIS.
      05 WS-QTDE-LIDA    PIC 9(05) VALUE 0.
      05 WS-QTDE-GRAVADA PIC 9(05) VALUE 0.
      05 WS-FIM-ARQ    PIC X VALUE 'N'.
      05 WS-FIM-PROC   PIC X VALUE 'N'.
 
PROCEDURE DIVISION.

0000-10-ROTINA-PRINCIPAL SECTION.

    PERFORM 0010-10-INICIO THRU 0010-99-EXIT
    PERFORM 0020-10-LE-ARQUIVO THRU 0020-99-EXIT
    IF WS-FIM-ARQ = 'S'
        DISPLAY 'ATENCAO: ARQUIVO VAZIO.'
        STOP RUN
    END-IF 
    PERFORM 0100-10-PROCESSA-REGISTRO THRU 0100-99-EXIT
        UNTIL WS-FIM-ARQ = 'S'
    PERFORM 0900-10-FIM THRU 0900-99-EXIT
    STOP RUN.

0000-99-EXIT. 
      EXIT.

0010-10-INICIO SECTION.

    OPEN INPUT ARQ-CLIENTES
    IF WS-FS-IN NOT = 00
     DISPLAY 'Erro ao abrir arquivo. Status: ' WS-FS-IN
     STOP RUN
    END-IF

    OPEN OUTPUT ARQ-REJEITADOS
    IF WS-FS-OUT NOT = 00
     DISPLAY 'Erro ao abrir arquivo de saida. Status: ' WS-FS-OUT
     STOP RUN
    END-IF

    DISPLAY 'INICIO DO PROCESSAMENTO BATCH'
    DISPLAY ' '.

0010-99-EXIT.
      EXIT.

0020-10-LE-ARQUIVO SECTION.
    READ ARQ-CLIENTES
        AT END
            MOVE 'S' TO WS-FIM-ARQ
            GO TO 0020-99-EXIT
    END-READ
    IF WS-FS-IN NOT = 00
        DISPLAY 'Erro LEITURA do arquivo. Status: ' WS-FS-IN
        STOP RUN
    END-IF
    ADD 1 TO WS-QTDE-LIDA.
0020-99-EXIT.
        EXIT.
0030-10-GRAVA-ARQUIVO SECTION.
    WRITE REG-REJEITADOS
        FROM REG-CLIENTE
    IF WS-FS-OUT NOT = 00
        DISPLAY 'Erro GRAVACAO do arquivo. Status: ' WS-FS-OUT
        STOP RUN
    END-IF
    ADD 1 TO WS-QTDE-GRAVADA.
0030-99-EXIT.
        EXIT.

0100-10-PROCESSA-REGISTRO SECTION.

      DISPLAY 'PROCESSANDO REGISTRO: ' WS-QTDE-LIDA

      IF WS-FIM-ARQ = 'N'
        IF CLI-ID NOT NUMERIC
           OR CLI-ID EQUAL ZEROS
           OR CLI-NOME EQUAL SPACES 
            MOVE REG-CLIENTE TO REG-REJEITADOS
            PERFORM 0030-10-GRAVA-ARQUIVO THRU 0030-99-EXIT
            DISPLAY 'REGISTRO REJEITADO. ID OU NOME INVALIDO.'
        ELSE
            DISPLAY 'REGISTRO ACEITO.'
            DISPLAY 'ID: ' CLI-ID ' NOME: ' CLI-NOME
        END-IF
            PERFORM 0020-10-LE-ARQUIVO THRU 0020-99-EXIT
      END-IF.

0100-99-EXIT.
      EXIT.
0900-10-FIM SECTION.
    CLOSE ARQ-CLIENTES
    IF WS-FS-IN NOT = 00
      DISPLAY "Erro ao fechar arquivo. Status: " WS-FS-IN
      STOP RUN
    END-IF

    CLOSE ARQ-REJEITADOS
    IF WS-FS-OUT NOT = 00
      DISPLAY "Erro ao fechar arquivo de saida. Status: " WS-FS-OUT
      STOP RUN
    END-IF

    DISPLAY 'TOTAL DE REGISTROS LIDOS: ' WS-QTDE-LIDA
    DISPLAY 'TOTAL DE REGISTROS REJEITADOS: ' WS-QTDE-GRAVADA
    DISPLAY 'FIM DO PROCESSAMENTO'.
0900-99-EXIT.
      EXIT.
